In [49]:
import pandas as pd
import numpy as np

In [16]:
data_ojol = {'Customer':['tom', 'nick', 'krish', 'jack', 'jack', 'tom', 'jack', 'krish', 'nick', 'nick'],
          'Origin':['Tebet', 'Gondangdia', 'Mampang', 'SCBD', 'SCBD', 'Kuningan', 'Pancoran', 'Tebet', 'Mampang', 'Tebet'],
          'Destination':['Gondangdia', 'Mampang', 'SCBD', 'Kuningan', 'Pancoran', 'Pancoran', 'Mampang', 'SCBD', 'SCBD', 'Kuningan'],
          'Distance': [4.5, 5.0, 3.0, 4.8, 2.2, 4.7, 3.4, 4.0, 2.2, 2.9],
          'Price': [20000, 23000, 14000, 24500, 7000, 20000, 15000, 18500, 9000, 11000]}
          
data_ojol = pd.DataFrame(data_ojol)

In [17]:
data_ojol
# type(data_ojol)

  Customer      Origin Destination  Distance  Price
0      tom       Tebet  Gondangdia       4.5  20000
1     nick  Gondangdia     Mampang       5.0  23000
2    krish     Mampang        SCBD       3.0  14000
3     jack        SCBD    Kuningan       4.8  24500
4     jack        SCBD    Pancoran       2.2   7000
5      tom    Kuningan    Pancoran       4.7  20000
6     jack    Pancoran     Mampang       3.4  15000
7    krish       Tebet        SCBD       4.0  18500
8     nick     Mampang        SCBD       2.2   9000
9     nick       Tebet    Kuningan       2.9  11000

In [23]:
# data_ojol['Origin'].unique()
# type(data_ojol['Origin'].unique())
list(data_ojol['Origin'].unique())

['Tebet', 'Gondangdia', 'Mampang', 'SCBD', 'Kuningan', 'Pancoran']

In [19]:
data_ojol['Distance'].mean()

3.6700000000000004

In [20]:
data_ojol['Distance'].median()

3.7

In [24]:
data_ojol['Distance'].mode()

0    2.2
dtype: float64

Aggregate dataframe

.groupby()
-sum
-count
-max
-min
-mean
-mode
-median

In [26]:
data_ojol

  Customer      Origin Destination  Distance  Price
0      tom       Tebet  Gondangdia       4.5  20000
1     nick  Gondangdia     Mampang       5.0  23000
2    krish     Mampang        SCBD       3.0  14000
3     jack        SCBD    Kuningan       4.8  24500
4     jack        SCBD    Pancoran       2.2   7000
5      tom    Kuningan    Pancoran       4.7  20000
6     jack    Pancoran     Mampang       3.4  15000
7    krish       Tebet        SCBD       4.0  18500
8     nick     Mampang        SCBD       2.2   9000
9     nick       Tebet    Kuningan       2.9  11000

In [32]:
data_ojol.groupby('Customer', as_index=False)['Distance'].sum()

  Customer  Distance
0     jack      10.4
1    krish       7.0
2     nick      10.1
3      tom       9.2

In [43]:
data_ojol.groupby('Customer')['Distance'].sum()

Customer
jack     10.4
krish     7.0
nick     10.1
tom       9.2
Name: Distance, dtype: float64

In [44]:
data_ojol.groupby('Customer', as_index=False)\
          .agg({'Distance' : ['sum', 'mean'],
                'Price' : ['mean']})

  Customer Distance                   Price
                sum      mean          mean
0     jack     10.4  3.466667  15500.000000
1    krish      7.0  3.500000  16250.000000
2     nick     10.1  3.366667  14333.333333
3      tom      9.2  4.600000  20000.000000

In [48]:
data_ojol.groupby(['Origin', 'Destination'], as_index=False).count()

       Origin Destination  Customer  Distance  Price
0  Gondangdia     Mampang         1         1      1
1    Kuningan    Pancoran         1         1      1
2     Mampang        SCBD         2         2      2
3    Pancoran     Mampang         1         1      1
4        SCBD    Kuningan         1         1      1
5        SCBD    Pancoran         1         1      1
6       Tebet  Gondangdia         1         1      1
7       Tebet    Kuningan         1         1      1
8       Tebet        SCBD         1         1      1

Sort Values Dataframe

In [ ]:
data_ojol.groupby(['Origin', 'Destination'], as_index=False).count()\
.sort_values('Origin', ascending = False)

In [ ]:
data_bike_csv = pd.read_csv('http://bit.ly/dwp-data-bike')

In [ ]:
data_bike_csv

In [ ]:
data_bike_excel = pd.read_excel('http://bit.ly/dwp-data-bike')

In [ ]:
data_bike_excel